docs/site/bullock13_live_elect_pract.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-21 Sat 11:04 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>bullock13_live_elect_pract</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="../style.css" type="text/css">
</head>
<body>
<div id="content" class="content">
<h1 class="title">bullock13_live_elect_pract</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#bullock13_live_elect_pract">Live electronics in practice: approaches to training professional performers</a>
<ul>
<li><a href="#orgdaf4c57">Notes for page 2</a>
<ul>
<li><a href="#org428eb09">Education</a></li>
<li><a href="#org32efc38">Microphone Challenge</a></li>
<li><a href="#org59a539f">Control</a></li>
</ul>
</li>
<li><a href="#orgd8d11e4">Divergence</a></li>
<li><a href="#orgc691fc0">Problems</a></li>
<li><a href="#org543a143">Example 1</a></li>
<li><a href="#org9cb747a">Example 2</a></li>
<li><a href="#org0b093f2">Example 3</a></li>
<li><a href="#orgc64c96b">Results</a></li>
<li><a href="#org9d298fc">Discussion</a></li>
<li><a href="#org5090494">Benefit</a></li>
<li><a href="#orgcd0fa88">Practice Rooms</a></li>
</ul>
</li>
</ul>
</div>
</div>
<dl class="org-dl">
<dt>keywords</dt><dd></dd>
</dl>
<div id="outline-container-bullock13_live_elect_pract" class="outline-2">
<h2 id="bullock13_live_elect_pract">Live electronics in practice: approaches to training professional performers</h2>
<div class="outline-text-2" id="text-bullock13_live_elect_pract">
</div>
<div id="outline-container-orgdaf4c57" class="outline-3">
<h3 id="orgdaf4c57">Notes for page 2</h3>
<div class="outline-text-3" id="text-orgdaf4c57">
</div>
<div id="outline-container-org428eb09" class="outline-4">
<h4 id="org428eb09">Education</h4>
<div class="outline-text-4" id="text-org428eb09">
<p>
   It is rare to receive training with live electronic music. Composers in higher ed will get the training, but not the performers. This should change.
First experience is usually in final prep.
</p>
</div>
</div>
<div id="outline-container-org32efc38" class="outline-4">
<h4 id="org32efc38">Microphone Challenge</h4>
<div class="outline-text-4" id="text-org32efc38">
<p>
Performers have to be aware of their physical distance to a microphone when performing, something we don't normally have to do. Our normal expressive movements may counter what we want to do with our sound.
</p>

<p>
Speaker and cable latency can pose additional challenges
</p>
</div>
</div>
<div id="outline-container-org59a539f" class="outline-4">
<h4 id="org59a539f">Control</h4>
<div class="outline-text-4" id="text-org59a539f">
<p>
As performers we want to feel in control of our sound at all times. 
</p>
</div>
</div>
</div>
<div id="outline-container-orgd8d11e4" class="outline-3">
<h3 id="orgd8d11e4">Divergence</h3>
<div class="outline-text-3" id="text-orgd8d11e4">
<p>
More about the divergence of composers' education and performers' education
</p>
</div>
</div>
<div id="outline-container-orgc691fc0" class="outline-3">
<h3 id="orgc691fc0">Problems</h3>
<div class="outline-text-3" id="text-orgc691fc0">
<p>
Two main problems, lack of training, and lack of performer centered software
</p>

<p>
Also questions to explore
</p>
</div>
</div>
<div id="outline-container-org543a143" class="outline-3">
<h3 id="org543a143">Example 1</h3>
<div class="outline-text-3" id="text-org543a143">
<p>
Performer-as-enactor paradigm. Realize composer intentions through a score
</p>
</div>
</div>
<div id="outline-container-org9cb747a" class="outline-3">
<h3 id="org9cb747a">Example 2</h3>
<div class="outline-text-3" id="text-org9cb747a">
<p>
Peformer-improviser paradigm. Used Integra Live
</p>
</div>
</div>
<div id="outline-container-org0b093f2" class="outline-3">
<h3 id="org0b093f2">Example 3</h3>
<div class="outline-text-3" id="text-org0b093f2">
<p>
Performer-as-enactor paradigm. Performer involved in composition process
</p>
</div>
</div>
<div id="outline-container-orgc64c96b" class="outline-3">
<h3 id="orgc64c96b">Results</h3>
<div class="outline-text-3" id="text-orgc64c96b">
</div>
</div>
<div id="outline-container-org9d298fc" class="outline-3">
<h3 id="org9d298fc">Discussion</h3>
<div class="outline-text-3" id="text-org9d298fc">
<p>
Performers favor practical approaches, with a performance at the end
</p>

<p>
Learning tech takes time and dedication, potentially years of study
</p>

<p>
Long term, gradual exposure is key
</p>
</div>
</div>
<div id="outline-container-org5090494" class="outline-3">
<h3 id="org5090494">Benefit</h3>
<div class="outline-text-3" id="text-org5090494">
<p>
Potential benefits on general musicianship, should be in higher ed performance instruction regardless of end goals
</p>
</div>
</div>
<div id="outline-container-orgcd0fa88" class="outline-3">
<h3 id="orgcd0fa88">Practice Rooms</h3>
<div class="outline-text-3" id="text-orgcd0fa88">
<p>
An idea for higher ed institutions to have live electronics practice rooms
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p><a href="sitemap.html">Site Map</a></p>
</div>
</body>
</html>
